import React from 'react'

const Find_map_card = () => {
  return (
    <>
      <div className='find_map_card'>
        <img src="./images/find_map/festival_img.jpg" alt="" />
        <div className='find_map_card_desc'>
          <h2>夏末微光祭</h2>
          <p>2025.07.14-07.15  9:00-18:00</p>
          <div className='anchors'>
          <a href="#"># 夏日祭典</a>
          <a href="#"># 質感選物</a>
          <a href="#"># 輕食餐飲</a>
          </div>
        </div>
        <svg width="29" height="25" viewBox="0 0 29 25" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M15.0781 21.1853L14.9375 21.3215L14.7828 21.1853C8.10313 15.3133 3.6875 11.4305 3.6875 7.49319C3.6875 4.76839 5.79688 2.7248 8.60938 2.7248C10.775 2.7248 12.8844 4.08719 13.6297 5.94005H16.2453C16.9906 4.08719 19.1 2.7248 21.2656 2.7248C24.0781 2.7248 26.1875 4.76839 26.1875 7.49319C26.1875 11.4305 21.7719 15.3133 15.0781 21.1853ZM21.2656 0C18.8188 0 16.4703 1.10354 14.9375 2.83379C13.4047 1.10354 11.0562 0 8.60938 0C4.27813 0 0.875 3.28338 0.875 7.49319C0.875 12.6294 5.65625 16.8392 12.8984 23.2016L14.9375 25L16.9766 23.2016C24.2188 16.8392 29 12.6294 29 7.49319C29 3.28338 25.5969 0 21.2656 0Z" fill="white" />
        </svg>
      </div>
    </>
  )
}

export default Find_map_card